/*
     ¿À¶óÅ¬ 
       SQL (¿À¶óÅ¬À» ½ÇÇàÇÏ´Â ¾ð¾î) => °Ë»ö (SELECT)
       ===
       DML (µ¥ÀÌÅÍ °ü¸®(Á¶ÀÛ)) => À¥ÇÁ·Î±×·¡¸Ó
         = SELECT : µ¥ÀÌÅÍ Ã£±â
         = INSERT : µ¥ÀÌÅÍ Ãß°¡
         = UPDATE : µ¥ÀÌÅÍ ¼öÁ¤
         = DELETE : µ¥ÀÌÅÍ »èÁ¦ 
       DDL :  »ý¼º (Å×ÀÌºí,ºä...)
              CREATE , DROP , ALTER , RENAME , TRUNCATE 
       DCL : REVOKE , GRANT 
       TCL : COMMIT , ROLLBACK 
       
       Table : ÀúÀå°ø°£ (column,row) => ´ÜÀ§ row
       
       1) SELECT : µ¥ÀÌÅÍ °Ë»ö 
          = Çü½Ä) 
            ======================================================
            SELECT *(ÀüÃ¼) | ¿øÇÏ´Â µ¥ÀÌÅÍ¸¸ Ãâ·Â (column1,column2..)
            FROM Å×ÀÌºí¸í(ºä¸í,SELECT~~)
            ====================================================== ÇÊ¼ö 
            [
               1. WHERE Á¶°Ç¹® (Çü½Ä  ÄÃ·³¸í ¿¬»êÀÚ °ª)  ==> ¿¬»êÀÚ
                                     name = 'È«±æµ¿'
               ===============================================
               2. GROUP BY ÄÃ·³¸í ===> ÁýÇÕÇÔ¼ö 
               3. HAVING ±×·ìÁ¶°Ç 
               ===============================================
               4. ORDER BY ÄÃ·³¸í ASC|DESC => ASC´Â »ý·«ÀÌ °¡´É
                           ===== ¹øÈ£»ç¿ë (ÄÄ·³ÀÇ À§Ä¡¹øÈ£)
                           ===== , ÀÌÁß Á¤·Ä 
            ]
            
        2) ¿¬»êÀÚ 
           = »ê¼ú ¿¬»êÀÚ : + , - , * , / %(MOD)
             ========== Çüº¯È¯ => 1+'1' = 2
                        º¯È¯ ÇÔ¼ö => TO_CHAR , TO_NUMBER , TO_DATE    (NUMBER)'1'(X)
           = ºñ±³ ¿¬»êÀÚ : °á°ú°ª : boolean(true/false)
                = (°°´Ù) , !=,<>,^= (°°Áö ¾Ê´Ù)
                           != : À¥ÇÁ·Î±×·¡¸Ó (ÀÚ¹Ù,C,C#)
                           <> : DBA
                           ^= : ÀúÁúÇÁ·Î±×·¡¸Ó
                < , > , <= ,>=
           = ³í¸® ¿¬»êÀÚ : °á°ú°ª : boolean(true/false)
                AND , OR
                ** & : ÀÔ·Â°ª ¹Þ´Â °æ¿ì 
                ** || : ¹®ÀÚ¿­ °áÇÕ 
           = IN => ¿©·¯°³ÀÇ OR¸¦ ´ëÃ¼
           = BETWEEN ~ AND =>  >= AND <= (±â°£,¹üÀ§)
           = NOT : ºÎÁ¤  => NOT BETWEEN , NOT LIKE , NOT IN  (!´Â ÀÚ¹Ù¿¡¼­ÀÇ ºÎÁ¤)
           = LIKE : %(¹®ÀÚ¿­ Á¦ÇÑÀÌ ¾ø´Ù) , _ (ÇÑ±ÛÀÚ)  
                    %  , %%  _%
                    => ÇÑ°è => REGEXP_LIKE() : LIKE¸¦ º¸¿ÏÇÑ ÇÔ¼ö 
           = NULL : ¸ðµç ¿¬»êÀÚ´Â NULL°ªÀ» Ã³¸® ÇÒ ¼ö ¾ø´Ù 
                    IS NULL
                    IS NOT NULL
        3) ³»ÀåÇÔ¼ö
           = ´ÜÀÏÇà ÇÔ¼ö (ROW´ÜÀ§·Î º¯°æ)
             ¹®ÀÚ ÇÔ¼ö 
               = LEGNTH('') : ¹®ÀÚ °¹¼ö
               = ***SUBSTR(¹®ÀÚ¿­ , ¹®ÀÚ½ÃÀÛ¹øÈ£, °¹¼ö) : ¹®ÀÚ¸¦ ÀÚ¸¦ °æ¿ì  (¹®ÀÚ¹øÈ£:¿À¶óÅ¬(1),ÀÚ¹Ù(0))
                 SUBSTR('ABCDEFG',2,3) ;
                          --- BCD
                 
               = INSTR(¹®ÀÚ¿­ , Ã£´Â ¹®ÀÚ, ¹®ÀÚ½ÃÀÛ¹øÈ£,¹®ÀÚÀ§Ä¡)
                 INSTR('A-B-C-D','-',1,3) => 6
                                     = ¾ç¼ö (¾Õ¿¡¼­ºÎÅÍ)
                                     = À½¼ö (µÚ¿¡¼­ºÎÅÍ)
               = RPAD(¹®ÀÚ¿­,¹®ÀÚÃâ·Â°¹¼ö,'¹®ÀÚ')
                            ========== ====
                 RPAD('ABC',2,'#') => AB
                 RPAD('ABC',7,'*') => ABC**** : IDÃ£±â,passwordÃ£±â
             ¼ýÀÚ ÇÔ¼ö 
               = ROUND() : ¹Ý¿Ã¸²
               = TRUNC() : ¹ö¸²
               = ***CEIL() : ¿Ã¸² =======> ÃÑÆäÀÌÁö 
             ³¯Â¥ ÇÔ¼ö 
               = ***SYSDATE : ÇöÀç ³¯Â¥,½Ã°£  => µî·ÏÀÏÀº ÀÚµ¿À¸·Î Ã³¸®½Ã 
               = MONTHS_BETWEEN => °ú°ÅºÎÅÍ ÇöÀç±îÁöÀÇ ÃÑ °³¿ù¼ö¸¦ Ãâ·Â 
                 MONTHS_BETWEEN(ÇöÀç,°ú°Å) = °è½Ã¹° (3~6°³¿ùÀÌ¸é Áö¿î´Ù)
             º¯È¯ ÇÔ¼ö
               = ***TO_CHAR 
                   = ³âµµ : YYYY,RRRR , YY , RR
                   = ¿ù : MM , M
                   = ÀÏ : DD
                   = ½Ã°£ : HH24,HH , MI (ºÐ) , ÃÊ(SS)
                   = ¼ýÀÚ Ç¥Çö : 99,999
             ÀÏ¹Ý ÇÔ¼ö 
               = ***NVL : NULL°ª ´ëÃ¼ 
               = NVL2 : NULL=> Ã³¸® , NOT NULL=>Ã³¸® 
                 NVL2(ÄÃ·³¸í, NULLÀÌ ¾Æ´Ñ °æ¿ì Ã³¸® , NULLÀÏ °æ¿ì Ã³¸®)
                      =====
                      NULLÀ» Æ÷ÇÔÇÏ°í ÀÖ´Â µ¥ÀÌÅÍ ÄÃ·³ 
               = DECODE : ´ÙÁß Á¶°Ç¹® 
               = CASE : ´ÙÁß ¼±ÅÃ¹® 
               = ***REGEXP_LIKE: Á¤±Ô½ÄÀ» ÀÌ¿ëÇÑ ÇÔ¼ö 
                 [],{}
                 [] => ÇÑ±ÛÀÚ , ¹üÀ§ ÁöÁ¤ÀÌ °¡´É [A],[A-Z][a-z][0-9][°¡-ÆR]
                 {} => ±ÛÀÚ °¹¼ö  => {3} , {1,3}
                 .  => _ (ÇÑ±ÛÀÚ)
                 [^] => Á¦¿Ü  [^A-Z] => ¾ËÆÄºª ´ë¹®ÀÚ´Â Á¦¿Ü  [^°¡-ÆR] 
                 ^ => ½ÃÀÛ ^A ^[0-9]
                 $ => ³¡ A$ [0-9]$
                 | => A|B => A OR B
                 * => A* (µÚ¿¡ ºÙ´Â ±ÛÀÚ°¡ 0°³ ÀÌ»ó)
                 + => A+ (µÚ¿¡ ºÙ´Â ±ÛÀÚ°¡ 1°³ ÀÌ»ó) 
                      ¸ÀÀÖ+ 
                      Â¥+
                      ¸Ê+
                      
           = ´ÙÁßÇà ÇÔ¼ö(ÁýÇÕÇÔ¼ö) => Åë°è (ÇÕ,Æò±Õ,Rank...)
        4) ¿©·¯°³ÀÇ Å×ÀÌºí ¿¬°áÈÄ °á°ú°ª ¾ò±â (JOIN)
        5) SQL¹®Àå ¿©·¯°³¸¦ ÇÕÃÄ¼­ ÇÑ°³ÀÇ SQL¹®ÀåÀ¸·Î º¯È¯ (¼­ºêÄõ¸®)
        ====================================================== DDL(Á¦¾àÁ¶°Ç) => DML
        6) VIEW , INDEX , SEQUENCE , FUNCTION , PROCEDURE , TRIGGER
*/
-- ÀüÃ¼ ¹ÂÁ÷ µ¥ÀÌÅÍ Ãâ·Â (*) 
SELECT *
FROM genie_music;

-- ¿øÇÏ´Â µ¥ÀÌÅÍ¸¸ Ãâ·Â (ÄÃ·³¸íÀ» ¾Ë°í ÀÖ¾î¾ß ÇÑ´Ù = DESC Å×ÀÌºí¸í)
SELECT title , singer 
FROM genie_music;

-- ÇÊ¿äÇÑ µ¥ÀÌÅÍ¸¸ Ãâ·Â (Á¶°Ç¿¡ ÇØ´çµÇ´Â µ¥ÀÌÅÍ¸¸ Ãâ·Â => WHERE)
-- ³ë·¡Áß¿¡ »õ·Ó°Ô ÁøÀÔÇÑ ¹ÂÁ÷ÀÇ ³ë·¡¸í°ú °¡¼ö¸í , »óÅÂ¸¦ Ãâ·Â 
SELECT title,singer,state
FROM genie_music
WHERE state='new';
-- ¹®ÀÚ¿­ÀÌ³ª ³¯Â¥ µ¥ÀÌÅÍ¸¦ ÄÚµù¿¡ ''À» ºÙ¿©¼­ »ç¿ë , ¿À¶óÅ¬Àº ¿ø·¡ ´ë¼Ò¹®ÀÚ ±¸ºÐÀ» ÇÏÁö ¾Ê´Â´Ù (´Ü ÀúÀåµÈ µ¥ÀÌÅÍ´Â ´ë¼Ò¹®ÀÚ¸¦ ±¸ºÐ)
-- »óÅÂ (À¯Áö,»ó½Â,ÇÏ°­,new) => Áßº¹ ¾øÀÌ Ãâ·Â => DISTINCT (Àå¸£ , Á÷À§ , ºÎ¼­ ...)
SELECT DISTINCT state
FROM genie_music;
-- ¹ÂÁ÷Áß¿¡ »ó½Â 10~30 »ó½ÂÇÑ ³ë·¡Á¦¸ñ, »óÅÂ , °¡¼ö¸í , ÁõÆø 
SELECT title,state,singer,idcrement
FROM genie_music
WHERE state='»ó½Â' AND idcrement BETWEEN 10 AND 30;

SELECT title,state,singer,idcrement
FROM genie_music
WHERE state='»ó½Â' AND idcrement>=10 AND idcrement<=30;

-- ¹ÂÁ÷¿¡¼­ °¡¼öÁß¿¡ ¾ÆÀÌ·Î ½ÃÀÛÇÑ °¡¼öÀÇ ¸ðµç Á¤º¸¸¦ Ãâ·Â 
SELECT *
FROM genie_music
WHERE singer LIKE '¾ÆÀÌ%';

SELECT no,title 
FROM genie_music
ORDER BY no ASC;










